Autodesk.Navisworks.Api.DocumentFileVersion
Enumeration of Navisworks Document file format versions.

Autodesk.Navisworks.Api.DocumentFileVersion.Current
Use the most recent version of the file format supported by the runtime

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2015
Version of file format used by Navisworks 2015

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2016
Version of file format used by Navisworks 2016

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2017
Version of file format used by Navisworks 2017

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2018
Version of file format used by Navisworks 2018

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2019
Version of file format used by Navisworks 2019

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2020
Version of file format used by Navisworks 2020

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2021
Version of file format used by Navisworks 2021

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2022
Version of file format used by Navisworks 2022

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2023
Version of file format used by Navisworks 2023

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2024
Version of file format used by Navisworks 2024

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2025
Version of file format used by Navisworks 2025

Autodesk.Navisworks.Api.DocumentFileVersion.Navisworks2026
Version of file format used by Navisworks 2027